cases/chpt4-ice-pT-cold/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             gtawFoam;

startFrom               latestTime;

startTime               latestTime;//0;

stopAt                  endTime;

endTime                 2500; // 20 mins

deltaT                  1e-3;

writeControl            adjustableRunTime;

writeInterval           100;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   1;//5;

maxAlphaCo      1;

maxDeltaT       1;

libs (
    "libdynamicFvMeshUser.so"
"libOpenFOAM.so"
"libsimpleSwakFunctionObjects.so"
"libswakFunctionObjects.so"
"libgroovyBC.so"
      );

// ************************************************************************* //
